Autodesk.Revit.DB.TessellatedShapeBuilderResult.GetIssuesForFaceSet(System.Int32)
Returns the array of issues encountered while processing
a face set with index 'setIndex'.
setIndex:
Index of the face set.
Returns:
Array of issues encountered while processing a face set
with index 'setIndex'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
'SetIndex' is a valid face set index for the results stored in 'this'.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult.GetNumberOfFaceSets
Gets number of face sets for which 'this' result was obtained.
Returns:
The number of face sets.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult.GetGeometricalObjects
When called the first time, returns geometrical objects which were built.
Later calls will throw exceptions.
Remarks:
Normally an array contains a single geometrical object
corresponding to either 'target' or 'fallback' type', but if
multiple face sets are being built with target/fallback of "AnyGeometry/Mesh",
then a two-element array with both geometry as the 1st element and mesh
as the 2nd can be returned. It happens if some of the face sets require a
fallback processing and some do not.
Returns:
Geometrical object which were built.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TessellatedShapeBuilderResult.AreObjectsAvailable
Shows whether 'issues' still contains the original data or whether
these data have already been relinquished by 'getGeometricalObjects'.
The former is true, the later is false.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult.Outcome
What kinds of geometrical objects were built.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult.HasInvalidData
Whether there were any inconsistencies in the face sets,
stored in the tessellated shape builder while building
geometrical objects.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderResult
Describes what TessellatedShapeBuilder has
construct.
Since:
2015